{
    "artciles": [
        {
            "quiztitle":"Quiz for Experiment",
            "containers":"5"
        },
        {
            "q": "One multiplexer can take the place of ___________",
            "option": [
                "Combinational logic circuits",
                "Several Ex-NOR gates",
                "Several SSI logic gates or combinational logic circuits"
            ],
            "answer": "Several SSI logic gates or combinational logic circuits",
            "description": "A multiplexer (or MUX) is a device that selects one of several analog or digital input signals and forwards the selected input into a single line, depending on the active select lines. Since many operational behaviour can be performed by using a multiplexer. Whereas, a combinational circuit is a combination of many logic gates which makes the circuit more complex"
        },
        {
            "q": "How many select lines would be required for an 8-line-to-1-line multiplexer?",
            "option": [
                "4",
                "8",
                "3"
            ],
            "answer": "3",
            "description": "2n input lines, n control lines and 1 output line available for MUX. Here, 8 input lines mean 23 inputs. So, 3 control lines are possible. Depending on the status of the select lines, the input is selected and fed to the output"
        },
        {
            "q": "Without any additional circuitry an 8:1 MUX can be used to obtain ____________",
            "option": [
                "Some but not all Boolean functions of 3 variables",
                "All function of 3 variables but none of 4 variables",
                "All functions of 4 variables"
            ],
            "answer": "All functions of 4 variables",
            "description": "A 2^n:1 MUX can implement all logic functions of (n+1) variables without any additional circuitry. Thus 8:1 MUX can implement all logic functions of (3+1) variables, for 4 variables there are 16 possible combinations. So to use 8:1 MUX use 3 inputs as select lines of MUX and the 4th input as input of MUX"
        },
        {
            "q": "If enable input is high then the multiplexer is ______________",
            "option": [
                "Enable",
                "Disable",
                "High Impedance"
            ],
            "answer": "Disable",
            "description": " If enable input is high then the multiplexer is disabled because enable input is in inverted mode always (i.e. E’)"
        },
        {
            "q": "The inputs/outputs of an analog multiplexer/demultiplexer are ____________",
            "option": [
                "Bidirectional",
                "Unidirectional",
                "Even parity"
            ],
            "answer": "Bidirectional",
            "description": "One multiplexer can be used as demultiplexer. Hence, it is called bidirectional or two-way transmission"
        },
        {
            "q": "Most demultiplexers facilitate which type of conversion?",
            "option": [
                "Decimal-to-hexadecimal",
                "Single input, multiple outputs",
                "Odd parity to even parity"
            ],
            "answer": " Single input, multiple outputs",
            "description": "A demultiplexer sends a single input to multiple outputs, depending on the select lines. Demultiplexer converts single input into multiple outputs"
        },
        {
            "q": "How many AND gates are required for a 1-to-8 multiplexer?",
            "option": [
                "2",
                "6",
                "8"
            ],
            "answer": "8",
            "description": " The number of AND gates required will be equal to the number of outputs in a demultiplexer, which are 8"
        },
        {
            "q": " Which IC is used for the implementation of 1-to-16 DEMUX?",
            "option": [
                "IC 74154",
                "IC 74155",
                "IC 74139"
            ],
            "answer": "IC 74154",
            "description": "IC 74154 is used for the implementation of 1-to-16 DEMUX, whose output is inverted input"
        },
        {
            "q": "Which of the following combinations of logic gates can decode binary 1101?",
            "option": [
                "One 4-input AND gate, one inverter",
                "One 4-input AND gate, one OR gate",
                "One 4-input NAND gate, one inverter"
            ],
            "answer": "One 4-input AND gate, one inverter",
            "description": "For decoding any number output must be high for that code and this is possible in One 4-input NAND gate, one inverter option only. A decoder is a combinational circuit that converts binary data to n-coded data upto 2n outputs"
        },
        {
            "q": "What is the indication of a short to ground in the output of a driving gate?",
            "option": [
                "Only the output of the defective gate is affected",
                "There is a signal loss to all load gates",
                "The node may be stuck in either the HIGH or the LOW state"
            ],
            "answer": "There is a signal loss to all load gates",
            "description": "Short to ground in the output of a driving gate indicates of a signal loss to all load gates. This results in information being disrupted and loss of data"
        },
        {
            "q": "The carry propagation can be expressed as ________",
            "option": [
                "Cp = AB",
                "Cp = A+B",
                "All but Y0 are LOW"
            ],
            "answer": "Cp = A+B",
            "description": "This happens in parallel adders (where we try to add numbers in parallel via more than one adders). A carry propagation occurs when carry from one adder needs to be forwarded to other adder and that second adder is holding the computation (addition) because carry from first adder has not come yet. So, there is a slight delay for second adder and this is known as carry propagation"
        },
        {
            "q": "3 bits full adder contains ________",
            "option": [
                "4 combinational inputs",
                "6 combinational inputs",
                "8 combinational inputs"
            ],
            "answer": "8 combinational inputs",
            "description": "Full Adder is a combinational circuit with 3 input bits and 2 output bits CARRY and SUM. Three bits full adder requires 23 = 8 combinational circuits"
        },
        {
            "q": "How many inputs will a decimal-to-BCD encoder have?",
            "option": [
                "8",
                "10",
                "16"
            ],
            "answer": "10",
            "description": "An encoder is a combinational circuit encoding the information of 2n input lines to n output lines, thus producing the binary equivalent of the input. Thus, a Decimal-to-bcd converter has decimal values as inputs which range from 0-9. So, total 10 inputs are there in a decimal-to-BCD encoder"
        },
        {
            "q": " If we record any music in any recorder, such types of process is called ___________",
            "option": [
                "Encoding",
                "Decoding",
                "Demultiplexing"
            ],
            "answer": "Encoding",
            "description": "If we record any music in any recorder, it means that we are giving data to a recorder. So, such process is called encoding. Getting back the music from the recorded data, is known as decoding"
        },
        {
            "q": "Can an encoder be a transducer?",
            "option": [
                "Yes",
                "No",
                "Both are not even related slightly"
            ],
            "answer": "Yes",
            "description": "Of course, a transducer is a device which has the capability to emit data as well as to accept. Transducer converts signal from one form of energy to another"
        },
        {
            "q": "How many OR gates are required for a Decimal-to-bcd encoder?",
            "option": [
                "10",
                "3",
                "4"
            ],
            "answer": "4",
            "description": "An encoder is a combinational circuit encoding the information of 2^n input lines to n output lines, thus producing the binary equivalent of the input"
        },
        {
            "q": "How many OR gates are required for an octal-to-binary encoder?",
            "option": [
                "3",
                "2",
                "8"
            ],
            "answer": "3",
            "description": "An encoder is a combinational circuit encoding the information of 2n input lines to n output lines, thus producing the binary equivalent of the input. Thus, in octal to binary encoder there are 8 (=23) inputs, thus 3 output lines"
        },
        {
            "q": "The discrepancy of 0 output due to all inputs being 0 or D0, being 0 is resolved by using additional input known as ___________",
            "option": [
                "Enable",
                "Disable",
                "Strobe"
            ],
            "answer": "Enable",
            "description": "Such problems are resolved by using enable input, which behaves as active if it gets 0 as input since it is an active-low pin"
        },
        {
            "q": "Can an encoder be called as multiplexer?",
            "option": [
                "No",
                "Yes",
                "Sometimes"
            ],
            "answer": "Yes",
            "description": "A multiplexer or MUX is a combination circuit that contains more than one input line, one output line and more than one selection line. Whereas, an encoder is also considered a type of multiplexer but without a single output line and without any selection lines"
        },
        {
            "q": " If two inputs are active on a priority encoder, which will be coded on the output?",
            "option": [
                "The higher value",
                "The lower value",
                "Both of the inputs"
            ],
            "answer": "The higher value",
            "description": "An encoder is a combinational circuit encoding the information of 2n input lines to n output lines, thus producing the binary equivalent of the input. If two inputs are active on a priority encoder, the input of higher value will be coded in the output"
        },
        {
            "q": "Which digital system translates coded characters into a more useful form?",
            "option": [
                "Decoder",
                "Encoder",
                "Multiplexer"
            ],
            "answer": "Decoder",
            "description": "A binary decoder is a combinational logic circuit which decodes binary information from n-inputs to a maximum of 2n outputs. Decoder converts the coded characters into our required data form"
        },
        {
            "q": "What control signals may be necessary to operate a 1-line-to-16 line decoder?",
            "option": [
                "A bubble indicates active-LOW",
                "A triangle indicates active-HIGH",
                "A triangle indicates active-LOW"
            ],
            "answer": "A bubble indicates active-LOW",
            "description": "A bubble indicates active-LOW in a decoder always. Enable pin of the decoder is usually active-LOW and is triggered on input being at 0"
        },
        {
            "q": "Which error detection method consists of just one redundant bit per data unit?",
            "option": [
                "Simple parity check",
                "Two-dimensional parity check",
                "CRC"
            ],
            "answer": "Simple parity check",
            "description": "A parity checker is an error detection method used for the purpose of detecting errors that may have been incorporated during transmission. Simple parity check method consists of just one redundant bit per data unit. It is again classified as even parity and odd parity"
        },
        {
            "q": "The BCD number 101011 has _______ parity",
            "option": [
                "Even",
                "odd",
                "Undefined"
            ],
            "answer": "Even",
            "description": "The given BCD number 101011 has even priority because it has even number of 1’s (i.e. 4)"
        },
        {
            "q": " Which gates are ideal for checking the parity bits?",
            "option": [
                "AND",
                "EX-OR",
                "EX-NOR"
            ],
            "answer": "EX-OR",
            "description": "Exclusive-OR gates are ideal for checking the parity of a binary number because they produce an output when the input has an odd number of 1’s. Therefore, an even-parity input to an EX-OR gate produces a low output, while an odd parity input produces a high output. While, in case of AND, it produces high output when all inputs are 1 else low. Whereas, NAND, does the opposite, by producing low output when all inputs are 1 else high"
        }
    ]
}